In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

# Read the dataset using pandas.

In [2]:
ratings=pd.read_csv('ratings.csv')

In [3]:
ratings.head()

   userId  movieId  rating   timestamp
0       1        2     3.5  1112486027
1       1       29     3.5  1112484676
2       1       32     3.5  1112484819
3       1       47     3.5  1112484727
4       1       50     3.5  1112484580

In [4]:
tags=pd.read_csv('tags.csv')

In [5]:
tags.head()

   userId  movieId            tag   timestamp
0      18     4141    Mark Waters  1240597180
1      65      208      dark hero  1368150078
2      65      353      dark hero  1368150079
3      65      521  noir thriller  1368149983
4      65      592      dark hero  1368150078

In [6]:
movies=pd.read_csv('movies.csv')

In [7]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

# Extract the first row from tags and print its type

In [8]:
tag_firstrow=tags.head(1)

In [9]:
tag_firstrow

   userId  movieId          tag   timestamp
0      18     4141  Mark Waters  1240597180

In [10]:
tag_firstrow.dtypes

userId        int64
movieId       int64
tag          object
timestamp     int64
dtype: object

# Extract row 0, 11, 2000 from tags DataFrame.

In [11]:
tags.iloc[[0,11,2000],:]

      userId  movieId                tag   timestamp
0         18     4141        Mark Waters  1240597180
11        65     1783      noir thriller  1368149983
2000     910    68554  conspiracy theory  1368043943

# Print index, columns of the DataFrame

In [12]:
print(tags.index,tags.columns)

RangeIndex(start=0, stop=465564, step=1) Index(['userId', 'movieId', 'tag', 'timestamp'], dtype='object')

In [13]:
print(ratings.index,ratings.columns)

RangeIndex(start=0, stop=20000263, step=1) Index(['userId', 'movieId', 'rating', 'timestamp'], dtype='object')

In [14]:
print(movies.index,movies.columns)

RangeIndex(start=0, stop=27278, step=1) Index(['movieId', 'title', 'genres'], dtype='object')

# Calculate descriptive statistics for the 'ratings' column of the ratings DataFrame.Verify using Describe()

In [15]:
ratings.head()

   userId  movieId  rating   timestamp
0       1        2     3.5  1112486027
1       1       29     3.5  1112484676
2       1       32     3.5  1112484819
3       1       47     3.5  1112484727
4       1       50     3.5  1112484580

In [52]:
print('count:',len(ratings))
print('mean:',ratings.rating.mean())
print('std:',ratings.rating.std())
print('min:',ratings.rating.min())
print('25%',np.percentile(ratings.rating,25))
print('50%',np.percentile(ratings.rating,50))
print('75%',np.percentile(ratings.rating,75))
print('Max',ratings.rating.max())

count: 20000263
mean: 3.5255285642993797
std: 1.051988919275684
min: 0.5
25% 3.0
50% 3.5
75% 4.0
Max 5.0

In [17]:
ratings['rating'].describe()

count    2.000026e+07
mean     3.525529e+00
std      1.051989e+00
min      5.000000e-01
25%      3.000000e+00
50%      3.500000e+00
75%      4.000000e+00
max      5.000000e+00
Name: rating, dtype: float64

# Filter out ratings with rating > 5

In [18]:
ratings.head()

   userId  movieId  rating   timestamp
0       1        2     3.5  1112486027
1       1       29     3.5  1112484676
2       1       32     3.5  1112484819
3       1       47     3.5  1112484727
4       1       50     3.5  1112484580

In [19]:
ratings_new=ratings[ratings['rating'] > 5]

In [20]:
ratings_new.head()

Empty DataFrame
Columns: [userId, movieId, rating, timestamp]
Index: []

# Find how many null values, missing values are present. Deal with them. Print out how many rows have been modified

In [21]:
#Missing values in Ratings
missing_df = ratings.isnull().sum(axis=0).reset_index()
missing_df.columns = ['variable', 'missing values']
missing_df['filling factor (%)']=(ratings.shape[0]-missing_df['missing values'])/ratings.shape[0]*100
missing_df.sort_values('filling factor (%)').reset_index(drop = True)

    variable  missing values  filling factor (%)
0     userId               0               100.0
1    movieId               0               100.0
2     rating               0               100.0
3  timestamp               0               100.0

In [22]:
#Missing values in Movies
missing_df = movies.isnull().sum(axis=0).reset_index()
missing_df.columns = ['variable', 'missing values']
missing_df['filling factor (%)']=(movies.shape[0]-missing_df['missing values'])/movies.shape[0]*100
missing_df.sort_values('filling factor (%)').reset_index(drop = True)

  variable  missing values  filling factor (%)
0  movieId               0               100.0
1    title               0               100.0
2   genres               0               100.0

In [23]:
#Missing values in tags
missing_df = tags.isnull().sum(axis=0).reset_index()
missing_df.columns = ['variable', 'missing values']
missing_df['filling factor (%)']=(tags.shape[0]-missing_df['missing values'])/tags.shape[0]*100
missing_df.sort_values('filling factor (%)').reset_index(drop = True)

    variable  missing values  filling factor (%)
0        tag              16           99.996563
1     userId               0          100.000000
2    movieId               0          100.000000
3  timestamp               0          100.000000

In [24]:
#Since we have very less missing values we can simply drop missing values from our dataframe
tags.dropna(axis=0,inplace=True)

In [25]:
missing_df = tags.isnull().sum(axis=0).reset_index()
missing_df.columns = ['variable', 'missing values']
missing_df['filling factor (%)']=(tags.shape[0]-missing_df['missing values'])/tags.shape[0]*100
missing_df.sort_values('filling factor (%)').reset_index(drop = True)

    variable  missing values  filling factor (%)
0     userId               0               100.0
1    movieId               0               100.0
2        tag               0               100.0
3  timestamp               0               100.0

# Filter out movies from the movies DataFrame that are of type 'Animation'

In [26]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [27]:
movies_animation=movies[movies['genres'].str.contains("Animation")]

In [28]:
movies_animation.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
12,13,Balto (1995),Adventure|Animation|Children
47,48,Pocahontas (1995),Animation|Children|Drama|Musical|Romance
236,239,"Goofy Movie, A (1995)",Animation|Children|Comedy|Romance
241,244,Gumby: The Movie (1995),Animation|Children

# Find the average rating of movies

In [29]:
ratings.head()

   userId  movieId  rating   timestamp
0       1        2     3.5  1112486027
1       1       29     3.5  1112484676
2       1       32     3.5  1112484819
3       1       47     3.5  1112484727
4       1       50     3.5  1112484580

In [30]:
print('The average ratings of movies are: ',ratings['rating'].mean())

The average ratings of movies are:  3.5255285642993797

# Perform an inner join of movies and tags based on movieId

In [31]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [32]:
tags.head()

   userId  movieId            tag   timestamp
0      18     4141    Mark Waters  1240597180
1      65      208      dark hero  1368150078
2      65      353      dark hero  1368150079
3      65      521  noir thriller  1368149983
4      65      592      dark hero  1368150078

In [33]:
df_inner = pd.merge(movies, tags, on='movieId', how='inner')

In [34]:
df_inner.head()

,movieId,title,genres,userId,tag,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1644,Watched,1417736680
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1741,computer animation,1183903155
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1741,Disney animated feature,1183933307
3,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1741,Pixar animation,1183934770
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1741,TÃ©a Leoni does not star in this movie,1245093573

# Print out the 5 movies that belong to the Comedy genre and have rating greater than 4

In [35]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [36]:
ratings.head()

   userId  movieId  rating   timestamp
0       1        2     3.5  1112486027
1       1       29     3.5  1112484676
2       1       32     3.5  1112484819
3       1       47     3.5  1112484727
4       1       50     3.5  1112484580

In [37]:
df_inner = pd.merge(movies, ratings, on='movieId', how='inner')

In [38]:
df_inner.head()

,movieId,title,genres,userId,rating,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,3,4.0,944919407
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,6,5.0,858275452
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,8,4.0,833981871
3,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,10,4.0,943497887
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,11,4.5,1230858821

In [39]:
df_comedy=df_inner[df_inner['genres'].str.contains("Comedy")]

In [40]:
df_comedy.loc[df_comedy['rating'] > 4.0].head()

,movieId,title,genres,userId,rating,timestamp
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,6,5.0,858275452
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,11,4.5,1230858821
7,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,14,4.5,1225311239
9,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,19,5.0,855176628
14,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,34,5.0,846509445

# Split 'genres' into multiple columns

In [41]:
movies['genres'].str.get_dummies(sep='|').head()

,(no genres listed),Action,Adventure,Animation,Children,Comedy,Crime,Documentary,Drama,Fantasy,Film-Noir,Horror,IMAX,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,0,0,1,1,1,1,0,0,0,1,0,0,0,0,0,0,0,0,0,0
1,0,0,1,0,1,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
2,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,1,0,0,0,0
3,0,0,0,0,0,1,0,0,1,0,0,0,0,0,0,1,0,0,0,0
4,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0

# Extract year from title e.g. (1995)

In [42]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [43]:
pattern = '\((\d{4})\)'
movies['year'] = movies.title.str.extract(pattern, expand=False) #False returns a series

movies.head()

,movieId,title,genres,year
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1995
1,2,Jumanji (1995),Adventure|Children|Fantasy,1995
2,3,Grumpier Old Men (1995),Comedy|Romance,1995
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance,1995
4,5,Father of the Bride Part II (1995),Comedy,1995

# Select rows based on timestamps later than 2015-02-01

In [44]:
tags.head()

   userId  movieId            tag   timestamp
0      18     4141    Mark Waters  1240597180
1      65      208      dark hero  1368150078
2      65      353      dark hero  1368150079
3      65      521  noir thriller  1368149983
4      65      592      dark hero  1368150078

# Sort the tags DataFrame based on timestamp

In [45]:
tags.head()

   userId  movieId            tag   timestamp
0      18     4141    Mark Waters  1240597180
1      65      208      dark hero  1368150078
2      65      353      dark hero  1368150079
3      65      521  noir thriller  1368149983
4      65      592      dark hero  1368150078

In [46]:
sort_by_date=tags.sort_values('timestamp')

In [47]:
sort_by_date.head()

        userId  movieId              tag   timestamp
333932  100371     2788     monty python  1135429210
333927  100371     1732    coen brothers  1135429236
333924  100371     1206  stanley kubrick  1135429248
333923  100371     1193   jack nicholson  1135429371
333939  100371     5004    peter sellers  1135429399